## Nut Butter Store Sales

In [1]:
#working with random value
#1 - Creating a 5 x 3 matrix for butter sold
#2 - Creating a 1 x 3 matrix for different butter prices

In [3]:
import numpy as np
import pandas as pd

In [7]:
np.random.seed(0)
b_sale=np.random.randint(20, size=(5,3))

price = np.random.randint(20, size=(1,3))

In [8]:
b_sale

array([[12, 15,  0],
       [ 3,  3,  7],
       [ 9, 19, 18],
       [ 4,  6, 12],
       [ 1,  6,  7]])

In [9]:
price

array([[14, 17,  5]])

In [10]:
butter_sales = pd.DataFrame(b_sale,
                           index = ["Mon","Tue","Wed","Thurs","Fri"],
                           columns = ["Almond Butter","Peanut Butter","Cashew Butter"])
price_data = pd.DataFrame(price,
                           index = ["Price"],
                           columns = ["Almond Butter","Peanut Butter","Cashew Butter"])

In [11]:
butter_sales

       Almond Butter  Peanut Butter  Cashew Butter
Mon               12             15              0
Tue                3              3              7
Wed                9             19             18
Thurs              4              6             12
Fri                1              6              7

In [12]:
price_data

       Almond Butter  Peanut Butter  Cashew Butter
Price             14             17              5

In [13]:
butter_sales.shape

(5, 3)

In [15]:
price_data.shape

(1, 3)

In [18]:
total_sales = price_data.dot(butter_sales.T)
total_sales

       Mon  Tue  Wed  Thurs  Fri
Price  423  128  539    218  151

In [21]:
butter_sales["Total (in $)"] = total_sales.T

In [22]:
butter_sales

       Almond Butter  Peanut Butter  Cashew Butter  Total (in $)
Mon               12             15              0           423
Tue                3              3              7           128
Wed                9             19             18           539
Thurs              4              6             12           218
Fri                1              6              7           151

In [24]:
#creating original data 
b1_sale = np.array([[2,7,1],[9,4,16],[11,14,18],[13,13,16],[15,18,9]])
a1_sale = np.array([10,8,12])

In [26]:
daily_sales = pd.DataFrame(b1_sale,
                           index = ["Mon","Tue","Wed","Thurs","Fri"],
                           columns = ["Almond Butter","Peanut Butter","Cashew Butter"])

In [27]:
daily_sales

       Almond Butter  Peanut Butter  Cashew Butter
Mon                2              7              1
Tue                9              4             16
Wed               11             14             18
Thurs             13             13             16
Fri               15             18              9

In [28]:
butter_prices = pd.DataFrame(a1_sale,
                           index = ["Price"],
                           columns = ["Almond Butter","Peanut Butter","Cashew Butter"])

ValueError: Shape of passed values is (3, 1), indices imply (1, 3)

In [29]:
a1_sale.shape

(3,)

In [34]:
butter_sale = a1_sale.reshape(1,3)

In [35]:
butter_sale.shape

(1, 3)

In [36]:
butter_prices = pd.DataFrame(butter_sale,
                           index = ["Price"],
                           columns = ["Almond Butter","Peanut Butter","Cashew Butter"])

In [37]:
butter_prices

       Almond Butter  Peanut Butter  Cashew Butter
Price             10              8             12

In [38]:
daily_sales

       Almond Butter  Peanut Butter  Cashew Butter
Mon                2              7              1
Tue                9              4             16
Wed               11             14             18
Thurs             13             13             16
Fri               15             18              9

In [40]:
total_sale = butter_prices.dot(daily_sales.T)
total_sale

       Mon  Tue  Wed  Thurs  Fri
Price   88  314  438    426  402

In [42]:
daily_sales["Total (in $)"] = total_sale.T
daily_sales

       Almond Butter  Peanut Butter  Cashew Butter  Total (in $)
Mon                2              7              1            88
Tue                9              4             16           314
Wed               11             14             18           438
Thurs             13             13             16           426
Fri               15             18              9           402